<style lang="less" scoped>
    li {
        margin: 20px 0;
    }
    .first,
    .second {
        text-align: justify;
    }
    .third,
    .fourth {
        text-align-last: justify;
    }
</style>

<template>
    <main>
        <ul>
            <li class="first">两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐</li>

            <li class="second">两端对齐 两端对齐</li>

            <li class="third">两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐 两端对齐</li>

            <li class="fourth">两端对齐 两端对齐</li>
        </ul>
    </main>
</template>

<script>
    export default {}
</script>
